<a href="https://colab.research.google.com/github/sagar9926/Python_For_DataScience/blob/master/DataWrangling/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### Creating a data frame using lists :

In [0]:
import pandas as pd

In [0]:
Date = ["2016-03-01", 
"2016-03-02", 
"2016-03-01", 
"2016-03-03", 
"2016-03-02", 
"2016-03-03"]
Type = ["a","b","c","a","a","c"]
Value = [10.23,123.45,0.12,1.34,1.45,176]

In [0]:
df1 = {"Date": Date , "Type" : Type , "Value" : Value}

In [3]:
df1

{'Date': ['2016-03-01',
  '2016-03-02',
  '2016-03-01',
  '2016-03-03',
  '2016-03-02',
  '2016-03-03'],
 'Type': ['a', 'b', 'c', 'a', 'a', 'c'],
 'Value': [10.23, 123.45, 0.12, 1.34, 1.45, 176]}

In [7]:
df2 = pd.DataFrame(df1)
df2.head()

         Date Type   Value
0  2016-03-01    a   10.23
1  2016-03-02    b  123.45
2  2016-03-01    c    0.12
3  2016-03-03    a    1.34
4  2016-03-02    a    1.45

### Reshaping Data

In [9]:
df3= df2.pivot(index='Date', #Spread rows into columns
               columns='Type',
               values='Value') 
df3

Type            a       b       c
Date
2016-03-01  10.23     NaN    0.12
2016-03-02   1.45  123.45     NaN
2016-03-03   1.34     NaN  176.00

In [12]:
df4 = pd.pivot_table(df2,  
                     values='Value', index='Date', columns='Type')
df4

Type            a       b       c
Date
2016-03-01  10.23     NaN    0.12
2016-03-02   1.45  123.45     NaN
2016-03-03   1.34     NaN  176.00

### Stack vs Unstack

In [13]:
stacked = df2.stack()# Pivot a level of column labels
stacked

0  Date     2016-03-01
   Type              a
   Value         10.23
1  Date     2016-03-02
   Type              b
   Value        123.45
2  Date     2016-03-01
   Type              c
   Value          0.12
3  Date     2016-03-03
   Type              a
   Value          1.34
4  Date     2016-03-02
   Type              a
   Value          1.45
5  Date     2016-03-03
   Type              c
   Value           176
dtype: object

In [15]:
stacked.unstack() #Pivot a level of index labels

         Date Type   Value
0  2016-03-01    a   10.23
1  2016-03-02    b  123.45
2  2016-03-01    c    0.12
3  2016-03-03    a    1.34
4  2016-03-02    a    1.45
5  2016-03-03    c     176

### Melt : Gather columns into rows

In [20]:
 pd.melt(df2, 
         id_vars=["Date"], # This will remain unchanged
         value_vars=["Type", "Value"], # this will now accomodated into rows
         value_name="Observations") # this new column will now contain the values

          Date variable Observations
0   2016-03-01     Type            a
1   2016-03-02     Type            b
2   2016-03-01     Type            c
3   2016-03-03     Type            a
4   2016-03-02     Type            a
5   2016-03-03     Type            c
6   2016-03-01    Value        10.23
7   2016-03-02    Value       123.45
8   2016-03-01    Value         0.12
9   2016-03-03    Value         1.34
10  2016-03-02    Value         1.45
11  2016-03-03    Value          176

In [21]:
pd.melt(df2, 
         id_vars=["Date","Type"],
         value_vars=[ "Value"],
         value_name="Observations")

         Date Type variable  Observations
0  2016-03-01    a    Value         10.23
1  2016-03-02    b    Value        123.45
2  2016-03-01    c    Value          0.12
3  2016-03-03    a    Value          1.34
4  2016-03-02    a    Value          1.45
5  2016-03-03    c    Value        176.00

### Iterations

In [35]:
gen_obj = df2.iteritems()#(Column-index, Series) pairs
for el in gen_obj:print(el)

('Date', 0    2016-03-01
1    2016-03-02
2    2016-03-01
3    2016-03-03
4    2016-03-02
5    2016-03-03
Name: Date, dtype: object)
('Type', 0    a
1    b
2    c
3    a
4    a
5    c
Name: Type, dtype: object)
('Value', 0     10.23
1    123.45
2      0.12
3      1.34
4      1.45
5    176.00
Name: Value, dtype: float64)

In [37]:
gen_obj = df2.iterrows()  #(Row-index, Series) pairs
for el in gen_obj:print(el)

(0, Date     2016-03-01
Type              a
Value         10.23
Name: 0, dtype: object)
(1, Date     2016-03-02
Type              b
Value        123.45
Name: 1, dtype: object)
(2, Date     2016-03-01
Type              c
Value          0.12
Name: 2, dtype: object)
(3, Date     2016-03-03
Type              a
Value          1.34
Name: 3, dtype: object)
(4, Date     2016-03-02
Type              a
Value          1.45
Name: 4, dtype: object)
(5, Date     2016-03-03
Type              c
Value           176
Name: 5, dtype: object)